public class Demo {

   /*
    создать класс Car, содержащий поля model,manufacturer, year,colour и поведение
    -  drive, stop
    а также классы PassengerCar and Truck, расширяющие Car.
    Класс Truck должен иметь следующие характеристики и поведение важные для грузовиков.
    А именно: макс. грузоподьемность и обьем топливного бака.
    Поведение: 1. должен уметь загружаться (load) и при этом сообщать если превышена его грузоподьемность а также
    сообщать сколько еще можно загрузить груза.
               2. разгружаться и при этом сообщать в случае если пытаются разгрузить больше чем его имеющийся груз
               или число отрицательно а также сообщать о весе остающегося на борту груза
               3. в случае отсутствия топлива или отсутствия груза на борту сообщать о невозможности ехать
               4. уметь дозаправляться
    */
}
